# Establishing a Jupyter Notebook to read Titanic Data

In [16]:
import pandas as pd

In [17]:
titanic = pd.read_csv("../data/titanic.csv")

## Panda's interpretation of data types

In [18]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Selecting Subsets of Data

In [19]:
ages = titanic["Age"]

ages.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

### Using the Shape attribute

Tells you the number of rows and columns

In [20]:
# Do not use () not a method call
titanic["Age"].shape

(891,)

In [21]:
age_sex = titanic[["Age", "Sex"]]
age_sex

      Age     Sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

In [24]:
age_greater_than_35 = titanic[titanic["Age"] > 35]
print(age_greater_than_35)

     PassengerId  Survived  Pclass  \
1              2         1       1
6              7         0       1
11            12         1       1
13            14         0       3
15            16         1       2
..           ...       ...     ...
865          866         1       2
871          872         1       1
873          874         0       3
879          880         1       1
885          886         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
6                              McCarthy, Mr. Timothy J    male  54.0      0
11                            Bonnell, Miss. Elizabeth  female  58.0      0
13                         Andersson, Mr. Anders Johan    male  39.0      1
15                    Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
..                                                 ...     ...   ...    ...
865                           Bystrom, Mrs. (Karolina)  female  42.0      0
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  female  47.0      1
873                        Vander Cruyssen, Mr. Victor    male  47.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0

     Parch    Ticket     Fare Cabin Embarked
1        0  PC 17599  71.2833   C85        C
6        0     17463  51.8625   E46        S
11       0    113783  26.5500  C103        S
13       5    347082  31.2750   NaN        S
15       0    248706  16.0000   NaN        S
..     ...       ...      ...   ...      ...
865      0    236852  13.0000   NaN        S
871      1     11751  52.5542   D35        S
873      0    345765   9.0000   NaN        S
879      1     11767  83.1583   C50        C
885      5    382652  29.1250   NaN        Q

[217 rows x 12 columns]